-- init all tables
CREATE TABLE "user"(
    "id" SERIAL PRIMARY KEY,
    "password" VARCHAR(255) NOT NULL,
    "name" VARCHAR(255) NOT NULL,
    "username" VARCHAR(255) NOT NULL UNIQUE
);

CREATE TABLE "member"(
    "user_id" INTEGER NOT NULL REFERENCES "user"("id"),
    "address" VARCHAR(255),
    "email" VARCHAR(255) NOT NULL,
    "phone_num" VARCHAR(255),
    PRIMARY KEY("user_id")
);

CREATE TABLE "vendor"(
    "user_id" INTEGER NOT NULL REFERENCES "user"("id"),
    PRIMARY KEY("user_id")
);

CREATE TABLE "administrator"(
    "user_id" INTEGER NOT NULL REFERENCES "user"("id"),
    PRIMARY KEY("user_id")
);

CREATE TABLE "product"(
    "id" SERIAL PRIMARY KEY,
    "price" INTEGER NOT NULL,
    "description" VARCHAR(4095) NOT NULL,
    "name" VARCHAR(255) NOT NULL,
    "remain" INTEGER NOT NULL,
    "disability" BOOLEAN NOT NULL,
    "image_url" VARCHAR(255),
    "build_time" TIMESTAMP(0) WITHOUT TIME ZONE NOT NULL,
    "vendor_id" INTEGER NOT NULL REFERENCES vendor("user_id")
);

CREATE TABLE "favor"(
    "member_id" INTEGER NOT NULL REFERENCES "member"("user_id"),
    "product_id" INTEGER NOT NULL REFERENCES "product"("id"),
    "time" TIMESTAMP(0) WITHOUT TIME ZONE NOT NULL,
    PRIMARY KEY("member_id", "product_id")
);

CREATE TABLE "cart"(
    "member_id" INTEGER NOT NULL REFERENCES "member"("user_id"),
    "product_id" INTEGER NOT NULL REFERENCES "product"("id"),
    "time" TIMESTAMP(0) WITHOUT TIME ZONE NOT NULL,
    "count" INTEGER NOT NULL,
    PRIMARY KEY("member_id", "product_id")
);

CREATE TABLE "order"(
    "id" SERIAL PRIMARY KEY,
    "name" VARCHAR(255) NOT NULL,
    "description" VARCHAR(255) NOT NULL,
    "state" VARCHAR(255) NOT NULL,
    "address" VARCHAR(255) NOT NULL,
    "phone_num" VARCHAR(255) NOT NULL,
    "member_id" INTEGER NOT NULL REFERENCES "member"("user_id"),
    "payment_method" INTEGER NOT NULL,
    "shipment_method" INTEGER NOT NULL
);

CREATE TABLE "list"(
    "order_id" INTEGER NOT NULL REFERENCES "order"("id"),
    "product_id" INTEGER NOT NULL REFERENCES "product"("id"),
    "count" INTEGER NOT NULL,
    "time" TIMESTAMP(0) WITHOUT TIME ZONE NOT NULL,
    PRIMARY KEY("order_id", "product_id")
);

CREATE TABLE "tag"(
    "id" SERIAL PRIMARY KEY,
    "name" VARCHAR(255) NOT NULL,
    "type" INTEGER NOT NULL
);

CREATE TABLE "own"(
    "product_id" INTEGER NOT NULL REFERENCES "product"("id"),
    "tag_id" INTEGER NOT NULL REFERENCES "tag"("id"),
    PRIMARY KEY("product_id", "tag_id")
);

-- init all default values
INSERT INTO "user" ("password", "name", "username") VALUES 
('$2a$10$QT7PBe0i.0EftDfL.fGMb.CpN5htUTCLx/vuxvywi3y9qnVwhVqeO', 'member', 'member'),
('$2a$10$QT7PBe0i.0EftDfL.fGMb.CpN5htUTCLx/vuxvywi3y9qnVwhVqeO', 'admin', 'admin'),
('$2a$10$QT7PBe0i.0EftDfL.fGMb.CpN5htUTCLx/vuxvywi3y9qnVwhVqeO', '鬼滅之刃 代理商', 'vendor1'),
('$2a$10$QT7PBe0i.0EftDfL.fGMb.CpN5htUTCLx/vuxvywi3y9qnVwhVqeO', '獵人Hunter 代理商', 'vendor2'),
('$2a$10$QT7PBe0i.0EftDfL.fGMb.CpN5htUTCLx/vuxvywi3y9qnVwhVqeO', '出租女友 代理商', 'vendor3'),
('$2a$10$QT7PBe0i.0EftDfL.fGMb.CpN5htUTCLx/vuxvywi3y9qnVwhVqeO', '間諜家家酒 代理商', 'vendor4'),
('$2a$10$QT7PBe0i.0EftDfL.fGMb.CpN5htUTCLx/vuxvywi3y9qnVwhVqeO', '進擊的巨人 代理商', 'vendor5'),
('$2a$10$QT7PBe0i.0EftDfL.fGMb.CpN5htUTCLx/vuxvywi3y9qnVwhVqeO', '刀劍神域 代理商', 'vendor6'),
('$2a$10$QT7PBe0i.0EftDfL.fGMb.CpN5htUTCLx/vuxvywi3y9qnVwhVqeO', '葬送的芙莉蓮 代理商', 'vendor7');

INSERT INTO "member"("user_id", "email") VALUES
(1, 'member@example.com');

INSERT INTO "administrator"("user_id") VALUES
(2);

INSERT INTO "vendor"("user_id") VALUES
(3);

INSERT INTO "tag"("name", "type") VALUES
('鬼滅之刃', 0),
('獵人Hunter', 0),
('出租女友', 0),
('間諜家家酒', 0),
('進擊的巨人', 0),
('刀劍神域', 0),
('葬送的芙莉蓮', 0),
('公仔', 1),
('徽章', 1),
('資料夾', 1),
('鑰匙圈', 1),
('馬克杯', 1),
('掛畫', 1),
('滑鼠墊', 1),
('雨傘', 1),
('衣服', 1);

-- TODO : add more products later
INSERT INTO "product"("price", "description", "name", "remain", "disability", "image_url", "build_time", "vendor_id") VALUES
(590, '此公仔為一名持劍角色，背景為黑暗森林，特效呈現出冰霜般的波動感，動態感強烈，細節精美。', 'SE公仔 柱稽古篇-時透無一郎', 100, false, 'https://imgur.com/a/YqzBXeK', '2024-12-25 00:00:00', 3),
(590, '公仔呈現一位角色搭配巨蛇環繞，角色身穿條紋衣，手握武士刀，氣勢逼人，紫色蛇特效增添神秘感。', 'SE公仔 柱稽古篇-伊黑小芭內', 50, false, 'https://imgur.com/a/G1U1Slh', '2024-12-25 00:01:20', 3),
(590, '這款公仔展現一名表情瘋狂的角色，手握利劍，身穿武士服，周圍綠色特效環繞，動作張力十足，氣氛緊張激烈。', 'SE公仔 柱稽古篇-不死川實彌', 50, false, 'https://imgur.com/a/ujKRgpo', '2024-12-25 00:03:10', 3),
(590, '該公仔一名身穿紫色和服的角色，持刀單眼蒙布，表情自信且從容，姿態輕鬆，整體風格帶有濃厚的和風氣息。', 'MAXIMATIC 宇隨天元', 40, false, 'https://imgur.com/a/xnM6FYT', '2024-12-26 10:00:10', 3),
(590, '這款公仔展現一位身披金色鎧甲的角色，頭頂雙角，背後環繞六個印有「憎」字的法器，搭配黑紅背景，氣勢莊嚴而充滿威懾力。', '鬼之裝EX 憎珀天', 75, false, 'https://imgur.com/a/MC1eq1G', '2024-12-26 10:20:10', 3),
(590, '這款公仔呈現一名擁有綠色頭髮的角色，手持鋸齒狀武器，身形瘦削，穿著破損的服飾，搭配綠色背景文字裝飾，散發詭異而邪魅的氛圍。', '鬼之裝EX 妓夫太郎', 75, false, 'https://imgur.com/a/5t1npHX', '2024-12-26 10:22:10', 3),
(590, '這款公仔描繪一位擁有白色長髮與鬼角的角色，身穿鮮豔紋路的服飾，搭配紫色背景文字，展現妖魅氣質與華麗細節，充滿強烈的視覺衝擊力。', '鬼之裝EX 墮姬', 75, false, 'https://imgur.com/a/OEwsCkX', '2024-12-24 09:24:50', 3),
(150, '一名戴著眼鏡、面帶微笑的少年角色，神情充滿朝氣，背景以柔和的綠色環形圖案襯托。', '第一彈徽章-竈門炭治郎', 150, false, 'https://imgur.com/a/2AXKTAN', '2024-12-21 00:01:00', 3),
(150, '一位身著粉色帽子與服飾的少女角色，表情溫柔可愛，背景以粉紫色圖案增添柔美氣息。', '第一彈徽章-竈門彌豆子', 150, false, 'https://imgur.com/a/MdkUQaG', '2024-12-21 00:02:00', 3),
(150, '一名金色頭髮的少年，眼神驚訝帶著些許天真，背景搭配米黃色圓環，展現純真的氛圍。', '第一彈徽章-我妻善逸', 150, false, 'https://imgur.com/a/cDHjluP', '2024-12-21 00:03:00', 3),
(150, '一位戴著野豬頭盔的少年，神情調皮且自信，背景以淺藍色環形設計增添活力感。', '第一彈徽章-嘴平伊之助', 150, false, 'https://imgur.com/a/I4GCSbb', '2024-12-21 00:04:00', 3),
(150, '一名表情冷峻的男子，黑色長髮隨風飄動，背景為深藍色圓形圖案，散發沉穩氣質。', '第一彈徽章-富岡義勇', 150, false, 'https://imgur.com/a/5x3usI9', '2024-12-21 00:05:00', 3),
(150, '一位穿著復古帽子與服裝的男子，笑容爽朗且自信，背景為褐色環形圖案，展現熱情的性格。', '第一彈徽章-煉獄杏壽郎', 150, false, 'https://imgur.com/a/Gzs7HlU', '2024-12-21 00:06:00', 3),
(150, '一名紫色髮梢的女子，微笑中帶著些許神秘，背景為紫色圓形設計，增添優雅氣息。', '第一彈徽章-胡蝶忍', 150, false, 'https://imgur.com/a/0jPjywp', '2024-12-21 00:07:00', 3),
(150, '一位帶著蝴蝶髮飾的少女，面容溫柔，散發恬靜的氣質，背景以柔粉紫色圖案烘托細膩美感。', '第一彈徽章-栗花落香奈乎', 150, false, 'https://imgur.com/a/zB599tf', '2024-12-21 00:08:00', 3),
(150, '少年角色手持盒子，背景為柔和的綠色窗框設計，展現出樸素與溫暖的氛圍。', 'A4資料夾-竈門炭治郎', 200, false, 'https://imgur.com/a/NVj8Ept', '2024-12-21 01:00:00', 3),
(150, '少女角色手抱籃子，頭戴粉色帽子，背景為粉色窗框設計，整體風格柔美可愛。', 'A4資料夾-竈門彌豆子', 200, false, 'https://imgur.com/a/zqW8VkK', '2024-12-21 01:01:00', 3),
(150, '金髮少年手持一封信，背景搭配米黃色窗框，突顯他純真的氣質。', 'A4資料夾-我妻善逸', 200, false, 'https://imgur.com/a/RXwDWNE', '2024-12-21 01:02:00', 3),
(150, '戴野豬頭盔的少年，手持武器，背景為淺藍色窗框設計，散發活力與野性。', 'A4資料夾-嘴平伊之助', 200, false, 'https://imgur.com/a/TWgpI2C', '2024-12-21 01:03:00', 3),
(150, '黑髮男子表情冷峻，手握武士刀，背景為深藍色窗框，呈現莊重與穩重的風格。', 'A4資料夾-富岡義勇', 200, false, 'https://imgur.com/a/i0GQ3i0', '2024-12-21 01:04:00', 3),
(150, '穿著復古西裝的男子，頭戴帽子，手持文件，背景為褐色窗框，展現紳士氣質。', 'A4資料夾-煉獄杏壽郎', 200, false, 'https://imgur.com/a/wi99Swa', '2024-12-21 01:05:00', 3),
(150, '紫髮梢女子，手持茶杯，背景為紫色窗框，營造神秘且優雅的氣息。', 'A4資料夾-胡蝶忍', 200, false, 'https://imgur.com/a/j1U9ugn', '2024-12-21 01:06:00', 3),
(150, '戴蝴蝶髮飾的少女，手持盤子，背景為粉紫色窗框設計，突顯恬靜與柔和的特質。', 'A4資料夾-栗花落香奈乎', 200, false, 'https://imgur.com/a/ZIfMyPD', '2024-12-21 01:07:00', 3),
(150, '這款資料夾以淡藍色為基調，左側為精緻的花卉與文字設計，展現典雅氛圍；右側描繪紫色西裝搭配白色荷葉領的宇隨天元，神情自信，整體設計充滿華麗與細節感。', 'A4資料夾-宇隨天元', 200, false, 'https://imgur.com/a/UykfVee', '2024-12-21 01:08:00', 3),
(150, '這款資料夾以淡藍色為主色調，左側設計以花卉與優雅文字呈現，彰顯細膩風格；右側描繪身著黑色服飾的時透無一郎，搭配帽子與藍綠漸變髮色，手持甜點，神情冷靜且專注，整體氛圍清新而精緻。', 'A4資料夾-時透無一郎', 200, false, 'https://imgur.com/a/LKAdlkt', '2024-12-21 01:09:00', 3),
(150, '這款資料夾是以甘露寺蜜璃為主題，整體粉紅色調超可愛，左邊是花卉和文字設計，簡約又精緻；右邊的蜜璃穿著和服，笑容甜美，手上還端著精緻的甜點，超級療癒！', 'A4資料夾-甘露寺蜜璃', 200, false, 'https://imgur.com/a/4JYHHde', '2024-12-21 01:10:00', 3),
(135, '這款鑰匙圈以Q版角色設計為特色，展現一名手持武士刀、表情開朗的少年，搭配綠色格紋背景，整體造型充滿可愛與活力感。', 'Q版鑰匙圈-竈門炭治郎', 80, false, 'https://imgur.com/a/PZPCi7M', '2024-12-21 02:00:00', 3),
(135, '這款鑰匙圈以Q版設計呈現金髮少年，他雙眼緊閉、持刀跪地，展現冷靜瞬間，搭配黃色格紋背景，整體風格溫暖又充滿張力。', 'Q版鑰匙圈-我妻善逸', 80, false, 'https://imgur.com/a/dVGYljl', '2024-12-21 02:01:00', 3),
(135, '這款鑰匙圈以Q版風格呈現戴著野豬頭盔的角色，雙手持刀擺出攻擊姿勢，背景以藍色格紋搭配，增添活潑且充滿力量的氛圍。', 'Q版鑰匙圈-嘴平伊之助', 80, false, 'https://imgur.com/a/DFsN26d', '2024-12-21 02:02:00', 3),
(135, '這款鑰匙圈以Q版風格呈現黑髮男子，表情冷峻，身披綠色花紋披風，手持武士刀，背景為淺藍色格紋，展現沉穩與強大的氣場。', 'Q版鑰匙圈-富岡義勇', 80, false, 'https://imgur.com/a/YfF4Kv5', '2024-12-21 02:03:00', 3);

INSERT INTO "product"("price", "description", "name", "remain", "disability", "image_url", "build_time", "vendor_id") VALUES
(1100, '這款公仔描繪一名黑髮少年身穿白色背心和綠色短褲，擺出戰鬥姿勢，雙手凝聚橙色能量球，神情充滿自信，展現動感與力量。', '小傑·富力士', 10, false, 'https://imgur.com/a/MFm3cle', '2024-12-27 00:00:00', ),
(580, '這款公仔呈現一位黑髮女性角色，身穿綠色服裝搭配金色裝飾，擺出優雅而充滿力量的姿勢，手中握有粉色能量效果，動態感十足。', '伊耳謎·揍敵客', 60, false, 'https://imgur.com/a/1kpX7LZ', '2024-12-27 00:01:00', ),
(580, '這款公仔描繪一名紅髮角色，身著黑紅相間的服裝，胸前點綴紅色符號，擺出輕鬆自信的姿態，手中展示粉色能量效果，充滿戲劇性與個性化特徵。', '西索·莫羅', 60, false, 'https://imgur.com/a/CcCySHn', '2024-12-27 00:02:00', ),
(580, '這款公仔描繪一名紫色頭髮的少女角色，蹲坐姿態自然，神情帶有一絲冷峻與思索，服裝簡約而富有動感，背景燈光營造出靜謐的氛圍。', '瑪奇·柯瑪琪娜', 60, false, 'https://imgur.com/a/Br1cCYd', '2024-12-27 00:03:00', ),
(580, '這款公仔描繪一名金色短髮的角色，身穿紫色系服裝，悠閒地坐在樹枝上，神情輕鬆自然，背景燈光柔和，營造出靜謐且放鬆的氛圍。', '俠客', 50, false, 'https://imgur.com/a/6DBccHy', '2024-12-27 00:04:00', ),
(280, '黑色尖髮的少年，身穿綠色服裝，神情活潑，右手揮舞展現元氣，背景搭配綠色圓形設計。', '小傑·富力士', 30, false, 'https://imgur.com/a/yj3ESNQ', '2024-12-27 01:00:00', ),
(280, '白髮少年踩著滑板，身穿藍白相間服飾，神情冷靜自信，背景以藍色圓形烘托動感。', '奇犽·揍敵客', 30, false, 'https://imgur.com/a/oHUmPUn', '2024-12-27 01:01:00', ),
(280, '金髮少年手持木棍，身穿藍色長袍，表情認真專注，背景使用淺橙色圓形設計。', '酷拉皮卡', 30, false, 'https://imgur.com/a/1MUt95n', '2024-12-27 01:02:00', ),
(280, '黑髮少年身穿西裝，動作奔跑帶有緊張感，神情驚訝，背景搭配淺藍色圓形，突顯動態氛圍。', '雷歐力·帕拉丁奈特', 30, false, 'https://imgur.com/a/Qyqwbvk', '2024-12-27 01:03:00', ),
(250, '黑色尖髮少年背對觀眾，穿著綠色套裝，肩背棕色背包，手持魚竿回眸一笑，背景為鮮明的綠色，突顯角色的冒險氣質。', '小傑·富力士', 70, false, 'https://imgur.com/a/jK4QJlT', '2024-12-27 01:30:00', ),
(250, '白髮少年側身回頭，身穿白色短袖與深色短褲，手中持著迴力刀，神情冷酷，背景為紫色，展現沉穩且神秘的氣息。', '奇犽·揍敵客', 70, false, 'https://imgur.com/a/5c8KMTG', '2024-12-27 01:31:00', ),
(250, '黑髮男子戴著眼鏡，穿著深藍色西裝，背對觀眾微微側頭，神情冷峻，背景為藍色，展現穩重與成熟的氣質。', '酷拉皮卡', 70, false, 'https://imgur.com/a/Kr9qLtB', '2024-12-27 01:32:00', ),
(250, '金髮少年面向觀眾，身穿白色襯衫和藍色長袍，手上戴著銀色鍊具，神情專注，背景為金黃色，突顯他的堅毅與決心。', '雷歐力·帕拉丁奈特', 70, false, 'https://imgur.com/a/vSLPAhc', '2024-12-27 01:33:00', ),
(250, '紅髮男子背對觀眾，身穿白色服裝，胸前印有黑桃與紅心符號，手中持一張撲克牌，露出自信笑容，背景為粉紅色，突顯其神秘與狡黠的特質。', '西索·莫羅', 70, false, 'https://imgur.com/a/xOdUNHd', '2024-12-27 01:34:00', ),
(250, '黑髮男子側身面向觀眾，身穿綠色服裝，腰間綴有金色裝飾，手持雙針，神情冷酷，背景為深綠色，展現其凌厲與決斷的氣場。', '伊耳謎·揍敵客', 70, false, 'https://imgur.com/a/JCxIKJP', '2024-12-27 01:35:00', ),
(250, '黑髮男子側身回頭，身穿紫色大衣，背後印有金色十字架圖案，領口鑲有白色毛邊，手中持撲克牌，背景為紫色，展現神秘與威嚴的氣息。', '庫洛洛·魯西魯', 70, false, 'https://imgur.com/a/jjOZdFS', '2024-12-27 01:36:00', ),
(250, '黑髮男子背對觀眾，身穿黑色大衣，背後印有骷髏與交叉骨頭圖案，手持武器微微回頭，背景為深藍色，展現冷酷與危險的氛圍。', '飛坦·博通', 70, false, 'https://imgur.com/a/gRPMmlz', '2024-12-27 01:37:00', ),
(480, '藍紫色背景搭配黑色蜘蛛圖案，象徵神秘與危險，簡約卻充滿張力的設計。', '獵人協會', 25, false, 'https://imgur.com/a/nZsh4ix', '2024-12-27 01:40:00', ),
(480, '以簡潔的「X」標誌為主，紅黑色對比突出，底部附有「Hunter Association」字樣，展現獵人協會的象徵。', '暗影旅團', 25, false, 'https://imgur.com/a/RPyiLZP', '2024-12-27 01:41:00', ),
(480, '黃色背景襯托黑髮少年角色，他身著經典服裝，神情自信，兩側的裝飾圖案增添活力感。', '小傑·富力士', 25, false, 'https://imgur.com/a/2WtiT5f', '2024-12-27 01:42:00', ),
(480, '黑紅菱形背景，描繪戴眼鏡的黑髮男子，他神態從容，風格復古而優雅。', '雷歐力·帕拉丁奈特', 25, false, 'https://imgur.com/a/ovabMmC', '2024-12-27 01:43:00', );

INSERT INTO "product"("price", "description", "name", "remain", "disability", "image_url", "build_time", "vendor_id") VALUES
(5500, '這款水原千鶴公仔以粉紅色泳裝設計，展現清純與性感兼具的氣質。流線型的設計與精緻雕工，重現角色的迷人姿態，是收藏家的必備之選。', '水原千鶴-競泳泳裝Ver.', 10, false, 'https://imgur.com/0QizMCb', '2024-12-28 00:00:00', ),
(6150, '水原千鶴的居家情境造型，身穿純白蕾絲睡衣，細節精緻到每一根褶皺，營造溫馨又浪漫的氣氛，是角色粉絲必不可少的收藏珍品。', '水原千鶴-透視睡衣天使白Ver.', 10, false, 'https://imgur.com/cSrXpv6', '2024-12-28 00:01:00', ),
(680, '這幅掛畫展現了水原千鶴優雅回眸的瞬間，穿著輕盈的夏日洋裝，背景描繪生動的街景，充滿浪漫氣息，為你的房間增添唯美與故事感。', '直向掛畫 水原千鶴', 50, false, 'https://imgur.com/cazvCtx', '2024-12-28 00:05:00', ),
(1320, '七海麻美的可愛女僕造型掛畫，以俏皮黑色比基尼與貓耳裝飾吸引目光，黃色背景搭配蕾絲細節，增添了甜美又不失性感的氛圍。', '掛畫 七海麻美-泳裝女僕', 25, false, 'https://imgur.com/LV7An3q', '2024-12-28 00:10:00', ),
(1320, '更科瑠夏的掛畫以清新藍白主題展現角色甜美的一面，女僕造型搭配可愛的甜點，活潑又俏皮，給人一種青春洋溢的感覺，是房間佈置的亮點選擇。', '掛畫 更科瑠夏-泳裝女僕', 25, false, 'https://imgur.com/kU3Jpdg', '2024-12-28 00:15:00', ),
(1320, '櫻澤墨的女僕造型掛畫，粉紅主題襯托她害羞內斂的性格，甜美可愛的服飾細節與溫暖的色調相結合，散發迷人魅力，是粉絲必備的裝飾品。', '掛畫 櫻澤墨-泳裝女僕', 25, false, 'https://imgur.com/n6BuVxz', '2024-12-28 00:20:00', ),
(160, '這款水原千鶴鑰匙圈以可愛的角色插圖為設計亮點，輕巧便攜，粉色調設計展現柔美氣質，是隨身攜帶角色魅力的最佳選擇，適合作為日常配件或小禮物。', '水原千鶴', 100, false, 'https://imgur.com/LMUEw76', '2024-12-28 01:10:00', ),
(160, '櫻澤墨的鑰匙圈設計以Instagram風格框架，搭配她羞澀可愛的形象，簡單卻充滿個性，適合喜愛低調又精緻設計的粉絲，是實用與收藏兼具的好物。', '櫻澤墨', 100, false, 'https://imgur.com/N6uZrvI', '2024-12-28 01:20:00', ),
(160, '滑鼠墊以水原千鶴的慵懶居家造型為主題，清晰的畫質與舒適材質讓操作手感極佳，深邃的星空背景更增添神秘氛圍，是電腦桌面的完美搭配。', '水原千鶴', 120, false, 'https://imgur.com/qPRVWzf', '2024-12-28 01:30:00', ),
(160, '這款滑鼠墊包含多位角色合影，色彩鮮艷且設計充滿活力，背景配上繽紛的彩帶，展現角色間的默契與互動，是動漫迷日常使用與收藏的不二之選。', '出租女友', 120, false, 'https://imgur.com/aGxfVSA', '2024-12-28 01:40:00', );

INSERT INTO "product"("price", "description", "name", "remain", "disability", "image_url", "build_time", "vendor_id") VALUES
(590, '這款模型呈現角色與巨型白色狗狗並肩奔跑的動感瞬間，角色驚訝的表情與狗狗毛茸茸的細節相得益彰，彷彿即將開啟一場刺激冒險。生動的動態設計與逼真的姿態細節，讓人仿佛親臨故事場景，是收藏的不二之選。', 'mission extend 安妮亞+彭德', 60, false, 'https://imgur.com/nvQHrfl', '2024-12-27 04:00:00', ),
(6850, '這款模型完美呈現家庭的溫馨互動，角色穿著可愛外套開心奔跑，父親一手提著購物袋展現沉穩紳士氣質。逼真的場景還原與細膩的表情設計，將角色間的情感展露無遺。適合喜愛日常溫馨氛圍的收藏迷', '安妮亞&洛伊德', 5, false, 'https://imgur.com/DUdCuHo', '2024-12-27 04:05:00', ),
(180, '滑鼠墊以聖誕節為主題，角色一家身穿冬裝，在節日市集中留下溫馨的回憶。背景細節還原出熱鬧的節日氛圍，巨型狗狗也融入其中，畫面生動而有趣。濃濃的冬日暖意，是喜歡劇情故事的粉絲家中必備的裝飾品。', '間諜家家酒', 70, false, 'https://imgur.com/ZAQba0t', '2024-12-27 04:10:00', ),
(360, '這款馬克杯以角色與狗狗為設計主題，呈現俏皮又治癒的插圖。粉白主色調清新淡雅，適合日常使用或收藏，帶來滿滿的童趣與溫暖氛圍。杯子細節做工精緻，為你每一天的飲品增添幸福感受，是粉絲的最佳選擇。', '嘟嘟馬克杯(350ML)安妮亞&彭德', 70, false, 'https://imgur.com/eRvuOSn', '2024-12-27 04:20:00', ),
(590, '這款模型展現了角色沉穩紳士的一面，柔和綠色毛衣與修身長褲的搭配，營造出低調又精緻的氣質。自然的站姿與自信的表情，充分展現角色魅力，背景場景溫暖舒適，適合欣賞角色日常溫馨風格的粉絲收藏。', '洛伊德-涼感服飾', 80, false, 'https://imgur.com/fVkO65I', '2024-12-27 04:30:00', ),
(280, '鑰匙圈以角色的企鵝玩偶為靈感，俏皮可愛的藍白配色搭配簡單線條設計，讓小物也充滿趣味感。輕便易攜，無論是掛在背包還是鑰匙上，都能成為吸睛的亮點。粉絲們攜帶這份可愛，隨時展現自己的喜好。', '大金屬入色鑰匙圈-企鵝', 135, false, 'https://imgur.com/cSZuBMC', '2024-12-27 04:40:00', ),
(280, '靈感來自角色的花生主題，這款鑰匙圈以鮮黃配色與俏皮的花生人形象吸引目光。輕巧實用，可輕鬆搭配各類包包或鑰匙，展現個性同時增添趣味。獨特設計使其成為粉絲們的日常亮點，適合作為小禮物或收藏。', '大金屬入色鑰匙圈-花生', 135, false, 'https://imgur.com/uTotETq', '2024-12-27 04:50:00', ),
(399, '這款掛畫以角色經典姿態為主題，背景搭配藍天與場景細節，展現角色活潑可愛的神情。畫布設計色彩鮮明、質感細膩，充滿動感與生氣。是粉絲裝飾房間、辦公桌的理想選擇，讓生活空間也能擁有故事氣息。', '掛畫-安妮亞', 45, false, 'https://imgur.com/wXuwrCH', '2024-12-26 03:22:00', ),
(590, '這款模型捕捉了角色天真爛漫的一刻，穿著鮮紅色連身裙搭配俏皮的貓耳髮飾，展現純粹的快樂與童真。動作張開雙臂，宛如跳著開心的舞步，笑容感染力十足，背景細節營造了溫暖的居家氛圍，是療癒系粉絲的最佳選擇！', '安妮亞-第一季ED服裝Ver.', 50, false, 'https://imgur.com/haClTQo', '2024-12-26 04:34:00', ),
(590, '這款模型以溫暖的鄉村田園風為主題，角色穿著柔和花紋的長裙，搭配明亮的黃色背心，整體配色充滿春日氣息。靴子與俏皮的高髮髻為整體增添細節，彷彿置身於鄉間小鎮，適合喜愛柔美風格的收藏者。', '安妮亞-時尚裝扮Vol3.5', 50, false, 'https://imgur.com/DWJ5oUX', '2024-12-26 04:36:00', ),
(590, '這款模型展現了角色的學院復古氣質，黑色連身裙與金色邊飾的搭配高貴又優雅，搭配圓頂帽與書包，細節十分考究。角色的自信笑容與行進姿勢增添動感，背景校園場景更襯托其故事性，是復古與學院風愛好者必備之選。', '安妮亞-ESPRESTO School style', 50, false, 'https://imgur.com/tyrKn3A', '2024-12-26 04:38:00', ),
(590, '這款模型以酷炫的秘密特工為主題，黑色緊身皮衣、墨鏡和武器配件，展現出角色神秘又強大的氣場。粉紅髮色與貓耳頭飾增加了俏皮感，整體造型充滿動感與張力，仿佛即將展開一場刺激的冒險，非常適合追求個性化收藏的粉絲！', '安妮亞-間諜服', 50, false, 'https://imgur.com/INezQJg', '2024-12-26 04:40:00', ),
(590, '以學院氣息濃厚的裝扮為主題，這款模型展現了角色優雅又充滿活力的一面。角色戴著草帽，身穿深綠色外套與復古領帶，搭配書本道具，彷彿剛從圖書館走出來。細節豐富，設計精緻，是書迷和學院風愛好者不可錯過的珍品。', '安妮亞-時髦版Vol2.5', 50, false, 'https://imgur.com/7EeBl5u', '2024-12-26 04:42:00', ),
(590, '這款模型以濃厚的英倫復古風為設計靈感，角色戴著俏皮的貝雷帽，身穿格紋大衣與短靴，散發濃濃的秋冬氛圍。橘紅色頭髮與休閒風搭配相得益彰，背景細節襯托出溫暖且自然的生活場景，是一款兼具質感與故事性的作品。', '安妮亞-時髦服裝穿搭Vol1.5', 50, false, 'https://imgur.com/Ixnlf4J', '2024-12-26 04:44:00', ),
(590, '這款模型呈現了角色的夏日休閒風情，穿著清新俏皮的水手服，搭配綠白條紋游泳圈，宛如站在陽光下的沙灘上。粉紅色頭髮增添了活潑感，細膩的做工讓每個細節栩栩如生，是熱愛夏日氛圍的粉絲必備收藏品。', '安妮亞-暑假', 50, false, 'https://imgur.com/Zu6Tirm', '2024-12-26 04:46:00', );

INSERT INTO "product"("price", "description", "name", "remain", "disability", "image_url", "build_time", "vendor_id") VALUES
(650, '回過神才發現，思考進擊的巨人雨傘的存在意義，已讓我廢寢忘食。所謂進擊的巨人雨傘，關鍵是進擊的巨人雨傘需要如何解讀。', '直傘-艾連&里維', 35, false, 'https://imgur.com/rIgroJp', '2024-12-29 00:00:00', ),
(360, '把里維馬克杯輕鬆帶過，顯然並不適合。老舊的想法已經過時了。里維馬克杯勢必能夠左右未來。探討里維馬克杯時，如果發現非常複雜，那麼想必不簡單。', '嘟嘟馬克杯(350ml)-里維', 65, false, 'https://imgur.com/cgGqW58', '2024-12-29 00:01:00', ),
(100, '深入的探討里維資料夾，是釐清一切的關鍵。一般來說，問題的關鍵看似不明確，但想必在諸位心中已有了明確的答案。帶著這些問題，我們一起來審視里維資料夾。', '炫光資料夾-里維', 110, false, 'https://imgur.com/PdMDSLb', '2024-12-29 00:02:00', ),
(580, '我們要從本質思考，從根本解決問題。儘管如此，別人往往卻不這麼想。巴金曾經認為，奮鬥就是生活，人生惟有前進。這段話雖短，卻足以改變人類的歷史。這必定是個前衛大膽的想法。透過逆向歸納，得以用最佳的策略去分析里維馬克杯。', '馬克杯-里維', 40, false, 'https://imgur.com/k0Cg4Ru', '2024-12-29 00:03:00', ),
(580, '艾連馬克杯因何而發生？馬爾頓曾提出，堅強的信心，能使平凡的人做出驚人的事業。這段話讓我所有的疑惑頓時豁然開朗。薩克雷曾經提到過，在現在的社會條件下，完全不勢利是不可能的。我希望諸位也能好好地體會這句話。', '馬克杯-艾連', 40, false, 'https://imgur.com/sAVXEcr', '2024-12-29 00:04:00', ),
(220, '曹禺曾經認為，一個真正的人，應該為人民用儘自己的才智，專長和精力，再離開人間。不然，他總會感受到遺憾，浪費了有限的生命。這讓我對於看待這個問題的方法有了巨大的改變。若能夠洞悉里維鑰匙圈各種層面的含義，勢必能讓思維再提高一個層級。', '鑰匙圈-里維', 90, false, 'https://imgur.com/DwphLFc', '2024-12-29 00:05:00', ),
(220, '塞萬提斯講過一段耐人尋思的話，有時一扇門雖然關上了，其餘的門卻是敞開的。這句話把我們帶到了一個新的維度去思考這個問題。這是不可避免的。對於艾連鑰匙圈，我們不能不去想，卻也不能走火入魔。', '鑰匙圈-艾連', 90, false, 'https://imgur.com/upGsRpu', '2024-12-29 00:06:00', ),
(320, '當你搞懂後就會明白了。一般來講，我們都必須務必慎重的考慮考慮。洛克講過，學到很多東西的訣竅，就是一下子不要學很多。這啟發了我。白哲特曾經提過，堅強的信念能贏得強者的心，並使他們變得更堅強。這段話讓我所有的疑惑頓時豁然開朗。對我個人而言，艾連·葉卡資料夾不僅僅是一個重大的事件，還可能會改變我的人生。', '艾連·葉卡', 65, false, 'https://imgur.com/3fJMuBk', '2024-12-29 00:07:00', ),
(320, '我們一般認為，抓住了問題的關鍵，其他一切則會迎刃而解。米卡莎·阿卡曼資料夾勢必能夠左右未來。米卡莎·阿卡曼資料夾的出現，重寫了人生的意義。', '米卡莎·阿卡曼', 65, false, 'https://imgur.com/YwgU0rY', '2024-12-29 00:08:00', ),
(320, '若沒有阿爾敏·亞魯雷特資料夾的存在，那麼後果可想而知。如果仔細思考阿爾敏·亞魯雷特資料夾，會發現其中蘊含的深遠意義。', '阿爾敏·亞魯雷特', 65, false, 'https://imgur.com/XLNX4cp', '2024-12-29 00:09:00', ),
(320, '席慕蓉深信，金錢是一種有用的東西，但是，只有在你覺得知足的時候，它才會帶給你快樂，否則的話，它除了給你煩惱和妒忌之外，毫無任何積極的意義。但願諸位理解後能從中有所成長。儘管如此，我們仍然需要對里維·阿卡曼 資料夾保持懷疑的態度。', '里維·阿卡曼', 65, false, 'https://imgur.com/cHlnk42', '2024-12-29 00:10:00', ),
(320, '領悟其中的道理也不是那麼的困難。我們普遍認為，若能理解透徹核心原理，對其就有了一定的了解程度。若能夠洞悉漢吉·佐耶 資料夾各種層面的含義，勢必能讓思維再提高一個層級。', '漢吉·佐耶', 65, false, 'https://imgur.com/I97IBUS', '2024-12-29 00:11:00', ),
(320, '經過上述討論，我們不得不相信，奧維德在不經意間這樣說過，愛容易輕信。這讓我對於看待這個問題的方法有了巨大的改變。每個人的一生中，幾乎可說碰到約翰·基爾休坦 資料夾這件事，是必然會發生的。', '約翰·基爾休坦', 65, false, 'https://imgur.com/jLP5zyR', '2024-12-29 00:12:00', ),
(320, '對於莎夏·布勞斯 資料夾，我們不能不去想，卻也不能走火入魔。既然，儘管莎夏·布勞斯 資料夾看似不顯眼，卻佔據了我的腦海。', '莎夏·布勞斯', 65, false, 'https://imgur.com/UbjhFak', '2024-12-29 00:14:00', ),
(320, '既然，所謂萊納·布朗 資料夾，關鍵是萊納·布朗 資料夾需要如何解讀。若能夠洞悉萊納·布朗 資料夾各種層面的含義，勢必能讓思維再提高一個層級。', '萊納·布朗', 65, false, 'https://imgur.com/q1Qm8Gu', '2024-12-29 00:15:00', );

INSERT INTO "product"("price", "description", "name", "remain", "disability", "image_url", "build_time", "vendor_id") VALUES
(12750, '精緻還原亞絲娜的經典形象，黑色兔女郎造型搭配細膩網襪與優雅曲線，展現迷人魅力，極具收藏價值。', '亞絲娜 兔女郎Ver.', 5, false, 'https://imgur.com/0Uxo2kg', '2024-12-30 02:00:00', ),
(650, '詩乃珍珠白兔女郎造型，以高質感呈現服裝與細節，搭配動態姿勢與個性魅力，為收藏粉絲的絕佳選擇。', '詩乃 兔女郎 珍珠白Ver.', 30, false, 'https://imgur.com/7nR0BSU', '2024-12-30 02:10:00', ),
(4680, '黑色襯衫展現亞絲娜的溫柔氣質與自然姿態，手持紅色杯子的休閒造型讓人倍感親切，適合收藏。', '亞絲娜 桐人襯衫Ver.', 20, false, 'https://imgur.com/JjSI81Y', '2024-12-30 02:20:00', ),
(4680, '白襯衫造型展現亞絲娜的清新與柔美，搭配甜美笑容與放鬆姿勢，完美體現角色日常風格。', '亞絲娜 襯衫Ver.', 20, false, 'https://imgur.com/RmbDg4J', '2024-12-30 02:30:00', ),
(180, '高質感印刷還原亞絲娜旅行主題插圖，溫泉背景與角色形象結合，實用與收藏兼具的完美選擇。', '亞絲娜 資料夾旅行Ver.', 80, false, 'https://imgur.com/gtt8Nn9', '2024-12-30 02:40:00', ),
(180, '桐人旅行主題資料夾，藍色海景襯托角色的活力形象，精緻設計兼具實用性與收藏價值。', '桐人 資料夾旅行Ver.', 80, false, 'https://imgur.com/pOSqwGR', '2024-12-30 02:50:00', ),
(600, '黑色T恤印有桐人招式「星光連流擊」主題設計，搭配日文字體與炫酷風格，展現粉絲的時尚魅力。', 'T-shirt 星光連流擊', 40, false, 'https://imgur.com/kDfFAW1', '2024-12-30 03:00:00', ),
(200, '內含兩款設計，展示桐人經典姿態與招式「星光連流擊」，採高光亮面製作，實用與收藏價值兼具。', '桐人 語錄炫光徽章組(2入)', 75, false, 'https://imgur.com/XFxSLOe', '2024-12-30 03:10:00', ),
(600, '黑色T恤以亞絲娜形象為主題，正面圖案精美，背面簡約風格，材質舒適，展現動漫粉絲的個性魅力。', 'T-shirt 亞絲娜', 40, false, 'https://imgur.com/8DulvDx', '2024-12-30 03:20:00', ),
(500, '橫向設計掛畫展現刀劍神域角色的細膩插圖，柔和色調與細緻印刷增添居家氛圍，完美點綴空間。', '掛畫 橫向 A款', 60, false, 'https://imgur.com/5RrxPSG', '2024-12-30 03:30:00', ),
(180, '精美插圖設計的滑鼠墊，提供舒適的使用體驗，角色魅力與實用功能兼具，是粉絲的必備配件。', '滑鼠墊-D款', 90, false, 'https://imgur.com/CVEHFy8', '2024-12-30 03:40:00', ),
(180, 'Q版角色滑鼠墊設計可愛，採用高品質材質製作，耐用實用，為你的工作空間增添更多動漫氛圍。', '滑鼠墊-F款(Q版)', 90, false, 'https://imgur.com/T1ySQ2H', '2024-12-30 03:50:00', ),
(300, '高畫質呈現亞絲娜與Argo的活潑互動，柔和色彩與細膩插圖完美結合，是居家裝飾的最佳選擇。', '掛畫-F款(亞+愛)', 45, false, 'https://imgur.com/ODejadM', '2024-12-30 04:00:00', ),
(320, '以騎士細劍為主題的鑰匙圈，還原武器細節，金屬材質堅固耐用，是粉絲隨身攜帶的最佳配件。', '騎士細劍鑰匙圈', 50, false, 'https://imgur.com/PRKXfgT', '2024-12-30 04:10:00', ),
(500, '半立體設計的金屬鑰匙圈，造型別緻細膩，兼具時尚與實用功能，展現刀劍神域的標誌性元素。', '半立體金屬鑰匙圈', 35, false, 'https://imgur.com/yErcIrZ', '2024-12-30 04:20:00', ),
(790, '刀劍神域後篇主題馬克杯，杯身圖案精美，容量適中，為日常使用與粉絲收藏的絕佳選擇。', '後篇 馬克杯', 35, false, 'https://imgur.com/CahTwTX', '2024-12-30 04:30:00', );

INSERT INTO "product"("price", "description", "name", "remain", "disability", "image_url", "build_time", "vendor_id") VALUES
(590, '這款「葬送的芙莉蓮」費倫BAP半身胸像公仔，呈現紫色長髮的費倫，臉上帶著淡淡的微笑，手托下巴，展現她沉靜且溫柔的一面，細節精緻，完全抓住角色的神韻！', '半身胸像公仔 費倫', 45, false, 'https://imgur.com/a/AmS6UhU', '2024-12-30 04:40:00', ),
(590, '這款「葬送的芙莉蓮」Luminasta 花園Ver. 公仔，展現芙莉蓮溫柔的一面，她手捧藍色小花，頭戴花環，身著白金邊服飾，背景為清新自然的花園場景，完美還原角色的寧靜與優雅氛圍！', '芙莉蓮-花園Ver.', 30, false, 'https://imgur.com/a/TuDwCG2', '2024-12-30 04:50:00', ),
(590, '這款「葬送的芙莉蓮」Luminasta 花園Ver. 公仔，展現芙莉蓮溫柔的一面，她手捧藍色小花，頭戴花環，身著白金邊服飾，背景為清新自然的花園場景，完美還原角色的寧靜與優雅氛圍！', '費倫-花園Ver.', 30, false, 'https://imgur.com/a/fvjzqNf', '2024-12-30 05:00:00', ),
(550, '這款「葬送的芙莉蓮」TAITO Desktop Cute 家居服版本公仔，展現芙莉蓮慵懶且專注閱讀的一面。她穿著溫暖的針織外套與家居裙，盤腿坐在書堆中，手捧一本書，背景模擬書房的柔和燈光，營造出靜謐而溫馨的氣氛，非常適合作為書桌擺件！', '芙莉蓮-家居服Ver.', 15, false, 'https://imgur.com/a/JaKiZ1v', '2024-12-30 05:10:00', ),
(590, '這款「葬送的芙莉蓮」SE Luminasta 費倫一般攻擊魔法版本公仔，展現費倫的戰鬥姿態。她身穿白色長裙，手握法杖，裙擺隨風飄動，腳下的藍色魔法特效動感十足，完美捕捉角色施展魔法的瞬間，兼具優雅與力量感！', '費倫-一般攻擊魔法Ver.', 40, false, 'https://imgur.com/a/dV4mO4n', '2024-12-30 05:20:00', ),
(590, '這款「葬送的芙莉蓮」BAP半身胸像公仔以芙莉蓮為主題，展現她溫柔且略帶思考的神情。她雙手托臉，紫色長髮紮成雙馬尾，身穿白金色裝飾的服飾，整體設計細膩優雅，完美捕捉角色的靜謐氣質，非常適合喜愛芙莉蓮的粉絲收藏！', '半身胸像公仔 芙莉蓮', 45, false, 'https://imgur.com/a/HGey1IR', '2024-12-30 05:30:00', ),
(590, '這款「葬送的芙莉蓮」SE坐姿PM公仔以芙莉蓮為主題，展現她盤腿而坐的安靜姿態，雙馬尾的捲髮造型增添可愛感。她身穿經典白金色邊的服飾，神情平和，背景設計為溫馨的室內環境，呈現出恬靜舒適的氛圍，非常適合作為收藏或擺飾品。', '坐姿公仔 捲髮芙莉蓮', 10, false, 'https://imgur.com/a/kBolhgE', '2024-12-30 05:40:00', ),
(590, '這款「葬送的芙莉蓮」BAP Glasscape 費倫公仔，以費倫坐姿形象為主題，展現她手持法杖的靜謐姿態。背景是一個華麗的圓形透明屏飾，上面描繪了其他角色的插畫與細緻花紋，增添了濃厚的故事感與收藏價值，設計優雅且富有藝術氣息，非常適合粉絲珍藏！', 'Glasscape 費倫', 55, false, 'https://imgur.com/a/fG8nnzw', '2024-12-30 05:50:00', ),
(590, '這款「葬送的芙莉蓮」BAP Glasscape 芙莉蓮公仔，展現芙莉蓮優雅的坐姿形象，手持紅寶石法杖，散發沉穩與智慧的氣質。背景是一個透明圓形屏飾，描繪了精美的花紋與其他角色的插畫，色調以藍色為主，充滿夢幻氛圍，整體設計細膩而具有故事感，是一款極具收藏價值的公仔！', 'Glasscape 芙莉蓮', 55, false, 'https://imgur.com/a/wIEkOtk', '2024-12-30 06:00:00', ),
(590, '這款「葬送的芙莉蓮」SE公仔 Yumemirize 從前時光 費倫版本，以費倫的靜謐姿態為主題。她坐在草地上，身穿黑色斗篷與白色洋裝，紫色短髮上別著蝴蝶髮飾，伸手輕觸飛舞的蝴蝶，背景以夢幻的夜晚場景點綴，充滿詩意與回憶感，非常適合喜愛費倫的粉絲收藏！', '從前時光 費倫', 25, false, 'https://imgur.com/a/I2opQrM', '2024-12-30 06:10:00', ),
(90, '這款「葬送的芙莉蓮」大胸章B款以費倫為主題，紫色背景搭配細緻的花卉圖案，襯托出費倫優雅端莊的氣質。胸章上的費倫身穿經典服飾，面帶溫柔的微笑，非常適合作為隨身配件或收藏，展現角色魅力！', '徽章 B款 費倫', 57, false, 'https://imgur.com/a/akBnsGT', '2024-12-30 06:20:00', ),
(90, '這款「葬送的芙莉蓮」大胸章A款以芙莉蓮為主題，背景為柔和的粉紫色與花卉圖案，展現出她的高貴與沉穩氣質。胸章上的芙莉蓮身著白金色經典服飾，神情溫柔，細膩的設計完美捕捉了角色的精髓，非常適合喜愛芙莉蓮的粉絲收藏或搭配使用！', '徽章 A款 芙莉蓮', 43, false, 'https://imgur.com/a/cCb8ft2', '2024-12-30 06:30:00', );

INSERT INTO "own"("product_id", "tag_id") VALUES
(1, 1),
(1, 8);